Autodesk.Revit.DB.Structure.StructuralConnectionsProviderRegistry.UnregisterConnectionsProvider
Unregisters Connections Provider.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no valid Connections Provider registered.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderRegistry.RegisterConnectionsProvider(Autodesk.Revit.DB.Structure.IStructuralConnectionsProvider)
Registers a connections provider.
provider:
Structural Connections Provider to be registered.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provider object is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is already registered Connections Provider.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderRegistry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderRegistry
An object that stores Structural Connections Provider.
Since:
2017